# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'gh'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'tree'

# Development
brew 'php@8.0'
brew 'php@7.4'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'phpmon'
cask 'ray'
cask 'setapp'
cask 'skype'
cask 'slack'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'CheatSheet', id: 529456740
mas 'Expressions', id: 913158085
mas 'HiddenMe', id: 467040476
mas 'Magnet', id: 441258766
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'The Unarchiver', id: 1147396723
mas 'Twitter', id: 1482454543
mas 'WhatsApp', id: 1147396723
